# АНАЛИЗ ДАННЫХ И ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ [in GameDev]
Отчет по лабораторной работе #2 выполнил(а):
- Есипенко Игорь Ярославович
- РИ220936
Отметка о выполнении заданий (заполняется студентом):

| Задание | Выполнение | Баллы |
| ------ | ------ | ------ |
| Задание 1 | * | 60 |
| Задание 2 | * | 20 |
| Задание 3 | * | 20 |

знак "*" - задание выполнено; знак "#" - задание не выполнено;

Работу проверили:
- к.т.н., доцент Денисов Д.В.
- к.э.н., доцент Панов М.А.
- ст. преп., Фадеев В.О.

[![N|Solid](https://cldup.com/dTxpPi9lDf.thumb.png)](https://nodesource.com/products/nsolid)

[![Build Status](https://travis-ci.org/joemccann/dillinger.svg?branch=master)](https://travis-ci.org/joemccann/dillinger)

Структура отчета

- Данные о работе: название работы, фио, группа, выполненные задания.
- Цель работы.
- Задание 1.
- Написать программу Hello World на Python с запуском в Jupiter Notebook.
- Задание 2.
- Написать программу Hello World на C# с запуском на Unity.
- Задание 3.
- Оформить отчет в виде документации на github (markdown-разметка).
- Выводы.
- ✨Magic ✨

## Цель работы
Научиться передавать в Unity данные из Google Sheets с помощью Python.

## Задание 1
### Выберать одну из компьютерных игр, привести скриншот её геймплея и краткое описание концепта игры. Выберать одну из игровых переменных в игре, описать её роль в игре, условия изменения / появления и диапазон допустимых значений. Построить схему экономической модели в игре и указать место выбранного ресурса в ней.

Ход работы:
- Для начала нужно было выбрать конкретную игру (я остановился на игре Genshin Impact). Genshin Impact - многопользовательская компьютерная онлайн игра, в которую можно играть как одному, так и с другими людьми.
- Концепт игры: Приключенческая игра с открытым миром. Это означает, что на той стороне реки или горы вас ожидает новый, восхитительный пейзаж, нужно лишь разумно расходовать силы. Если вам повстречается блуждающая фея или странный механизм, дерзните и попробуйте разгадать их тайну. Но что они сулят — беду или приятный сюрприз — сможете узнать только вы! В игре также есть:
- Взаимодействие стихий и разнообразные боевые тактики; - Визуальный стиль и прекрасная музыка; - Отправляйтесь в путешествие с компаньонами.(взято с официального сайта HoYolab)
- Скриншот геймплея игры:
![image](https://github.com/Yeager07/DA-in-GameDev-lab1/assets/127008112/6d750150-073a-4d02-8d79-616d6881512d)
- Для описания ресурса я выбрал первородную смолу.
- Описание: данный ресурс появляется у игрока каждый день; в течение 8 минут восстанавливается в количестве одной единицы; нужен для получения наград после прохождения босов или испытаний; можно восстановить за счет слабой смолы (отдельный игровой ресурс).
- Ниже предсавлена примерная экономическая модель данного ресурса:
![image](https://github.com/Yeager07/DA-in-GameDev-lab1/assets/127008112/785ff3fb-f7e7-4b1b-ba86-d9c9b8d6f0c1)

